tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core", "https://mirrors.ustc.edu.cn/homebrew-core.git"
brew "bat"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "fzf"
brew "htop"
brew "hugo"
brew "less"
brew "proxychains-ng"
brew "ripgrep"
brew "smartmontools"
brew "stow"
brew "wget"
brew "zoxide"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-mailutils", "with-modern-vscode-icon", "with-native-comp"]
cask "clashx"
cask "font-iosevka"
cask "iterm2"
cask "raycast"
